app/views/dreams/index.html.erb


					<% current_user.dreams.reverse.each do |d| %>
---
SELECT "dreams".* FROM "dreams" WHERE "dreams"."user_id" = $1  [["user_id", 11]]


					<% current_user.nightmares.reverse.each do |n| %>
---
SELECT "nightmares".* FROM "nightmares" WHERE "nightmares"."user_id" = $1  [["user_id", 11]]


					<% current_user.lucids.reverse.each do |l| %>
---
SELECT "lucids".* FROM "lucids" WHERE "lucids"."user_id" = $1  [["user_id", 11]]