app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
								<span class="text-small text-muted">By</span>
								<span class="text-small"><%= p.user.first_name %> <%= p.user.last_name %></span>