app/controllers/dreams_controller.rb

	def index
		@dreams = Dream.all.reverse
---
SELECT "dreams".* FROM "dreams"

	def show
		@dream = Dream.find(params[:id])
---
SELECT  "dreams".* FROM "dreams" WHERE "dreams"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

	def create
		@dream = Dream.new(user_id: current_user.id, title: params[:title], date: params[:date], category: [:category], description: params[:description], emotion: params[:emotion])

		if @dream.save
---
INSERT INTO "dreams" ("title", "date", "category", "description", "emotion", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def edit
		@dream = Dream.find(params[:id])
---
SELECT  "dreams".* FROM "dreams" WHERE "dreams"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

	def update
		@dream = Dream.find(params[:id])

		if @dream.user == current_user
			if @dream.update(title: params[:title], date: params[:date], category: [:category], description: params[:description], emotion: params[:emotion])
---
SELECT  "dreams".* FROM "dreams" WHERE "dreams"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
UPDATE "dreams" SET "date" = $1, "updated_at" = $2 WHERE "dreams"."id" = $3  [["date", "2019-11-02 00:00:00"], ["updated_at", "2019-11-02 15:35:19.408091"], ["id", 50]]

	def destroy
		@dream = Dream.find(params[:id])

		if @dream.destroy
---
SELECT  "dreams".* FROM "dreams" WHERE "dreams"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
DELETE FROM "dreams" WHERE "dreams"."id" = $1  [["id", 33]]