app/controllers/lucids_controller.rb

	def show
		@lucid = Lucid.find(params[:id])
---
SELECT  "lucids".* FROM "lucids" WHERE "lucids"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

	def create
		@lucid = Lucid.new(user_id: current_user.id, title: params[:title], date: params[:date], description: params[:description], emotion: params[:emotion])

		if @lucid.save
---
INSERT INTO "lucids" ("title", "date", "description", "emotion", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

	def edit
		@lucid = Lucid.find(params[:id])
---
SELECT  "lucids".* FROM "lucids" WHERE "lucids"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]

	def update
		@lucid = Lucid.find(params[:id])

		if @lucid.user == current_user
			if @lucid.update(title: params[:title], date: params[:date], description: params[:description], emotion: params[:emotion])
---
SELECT  "lucids".* FROM "lucids" WHERE "lucids"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
UPDATE "lucids" SET "title" = $1, "date" = $2, "updated_at" = $3 WHERE "lucids"."id" = $4  [["title", "You talking to me? bitch"], ["date", "2019-10-31 00:00:00"], ["updated_at", "2019-11-02 15:47:01.147636"], ["id", 40]]

	def destroy
		@lucid = Lucid.find(params[:id])

		if @lucid.destroy
---
SELECT  "lucids".* FROM "lucids" WHERE "lucids"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
DELETE FROM "lucids" WHERE "lucids"."id" = $1  [["id", 31]]