app/controllers/nightmares_controller.rb

SELECT "nightmares".* FROM "nightmares"
---
	def index
		@nightmares = Nightmare.all.reverse

SELECT  "nightmares".* FROM "nightmares" WHERE "nightmares"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
	def show
		@nightmare = Nightmare.find(params[:id])

INSERT INTO "nightmares" ("title", "date", "description", "emotion", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@nightmare = Nightmare.new(user_id: current_user.id, title: params[:title], date: params[:date], description: params[:description], emotion: params[:emotion])

		if @nightmare.save

SELECT  "nightmares".* FROM "nightmares" WHERE "nightmares"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
	def edit
		@nightmare = Nightmare.find(params[:id])

SELECT  "nightmares".* FROM "nightmares" WHERE "nightmares"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
UPDATE "nightmares" SET "title" = $1, "date" = $2, "updated_at" = $3 WHERE "nightmares"."id" = $4  [["title", "All right, Mr. DeMille, I'm ready for my closeup.lalalala"], ["date", "2019-11-01 00:00:00"], ["updated_at", "2019-11-02 15:40:02.058124"], ["id", 49]]
---
	def update
		@nightmare = Nightmare.find(params[:id])

		if @nightmare.user == current_user
			if @nightmare.update(title: params[:title], date: params[:date], description: params[:description], emotion: params[:emotion])

SELECT  "nightmares".* FROM "nightmares" WHERE "nightmares"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
DELETE FROM "nightmares" WHERE "nightmares"."id" = $1  [["id", 31]]
---
	def destroy
		@nightmare = Nightmare.find(params[:id])

		if @nightmare.destroy