app/controllers/posts_controller.rb

	def index
		@posts = Post.all.reverse
---
SELECT "posts".* FROM "posts"