app/views/nightmares/index.html.erb

						<!-- Dreams counter -->
						<% if current_user.dreams.count <= 0 %>
---
SELECT "dreams".* FROM "dreams" WHERE "dreams"."user_id" = $1  [["user_id", 11]]

						<!-- Nightmares counter -->
						<% if current_user.nightmares.count <= 0 %>
---
SELECT "nightmares".* FROM "nightmares"